---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SetDownFromBottom
source: html/453be523-ae50-a6e2-cc66-5303d87a211f.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SetDownFromBottom Property

The abbreviation of the Set Down from bottom of fitting (SDB) string.

## Syntax (C#)
```csharp
public string SetDownFromBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null